gh-fork-dump/illumos-gate/usr/src/man/man2/audit.2
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\"
.\" Copyright (c) 2008, Sun Microsystems, Inc.  All Rights Reserved.
.\"
.Dd March 6, 2017
.Dt AUDIT 2
.Os
.Sh NAME
.Nm audit
.Nd write a record to the audit log
.Sh LIBRARY
.Lb libbsm
.Lb libsocket
.Lb libnsl
.Sh SYNOPSIS
.In sys/param.h
.In bsm/libbsm.h
.Ft int
.Fn audit "caddr_t record" "int length"
.Sh DESCRIPTION
The
.Fn audit
function queues a record for writing to the system audit log.
The data pointed to by
.Fa record
is queued for the log after a minimal consistency check, with the
.Fa length
parameter specifying the size of the
.Fa record
in bytes.
The data should be a well-formed audit record as described by
.Xr audit.log 4 .
.Pp
The kernel validates the record header token type and length, and sets the time
stamp value before writing the record to the audit log.
The kernel does not do any preselection for user-level generated events.
If the audit policy is set to include sequence or trailer tokens, the kernel
will append them to the record.
.Sh RETURN VALUES
.Rv -std
.Sh ERRORS
The
.Fn audit
function will fail if:
.Bl -tag -width Er
.It Bq Er E2BIG
The record length is greater than the maximum allowed record length.
.It Bq Er EFAULT
The  record  argument points outside the process's allocated address space.
.It Bq Er EINVAL
The header token in the record is invalid.
.It Bq ErENOTSUP
Audit is not defined for this system.
.It Bq Er EPERM
The
.Brq Dv PRIV_PROC_AUDIT
privilege is not asserted in the effective set of the calling process.
.El
.Sh USAGE
Only privileged processes can successfully execute this call.
.Sh INTERFACE STABILITY
.Sy Committed
.Sh MT-LEVEL
.Sy MT-Safe
.Sh SEE ALSO
.Xr audit 1M ,
.Xr auditd 1M ,
.Xr svcadm 1M ,
.Xr auditon 2 ,
.Xr getaudit 2 ,
.Xr audit.log 4 ,
.Xr attributes 5 ,
.Xr privileges 5
.Sh NOTES
The functionality described in this man page is available only if the audit
daemon
.Xr auditd 1M
has not been disabled by
.Xr audit 1M
or
.Xr svcadm 1M .
