gh-fork-dump/illumos-gate/usr/src/man/man2/getisax.2
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\"
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\"
.Dd September 21, 2021
.Dt GETISAX 2
.Os
.Sh NAME
.Nm getisax
.Nd extract valid instruction set extensions
.Sh SYNOPSIS
.In sys/auxv.h
.Ft uint_t
.Fn getisax "uint32_t array" "uint_t n"
.Sh DESCRIPTION
The
.Fn getisax
function sets the vector
.Fa array
of
.Fa n
32-bit integers to contain the bits from the
.Dv AV_ Ns Ar arch Ns _ Ns Ar capability
namespace of the given instruction set architecture.
.Pp
The
.Dv AV_SPARC_ Ns Ar capability
values for SPARC and SPARCV9 \(em and their associated descriptions \(em can be
found in
.In sys/auxv_SPARC.h .
The
.Dv AV_386_ Ns Ar capability
values for i386 and AMD64 \(em and their associated descriptions \(em can be
found in
.In sys/auxv_386.h .
.Sh RETURN VALUES
The
.Fn getisax
function returns the number of array elements that contain non-zero values.
.Sh EXAMPLES
The following example writes a message if the SSE2 instruction set is present:
.Bd -literal -offset indent
uint_t ui;

(void) getisax(&ui, 1);

if (ui & AV_386_SSE2)
	printf("SSE2 instruction set extension is present.\en");
.Ed
.Sh INTERFACE STABILITY
.Sy Committed
.Sh MT-LEVEL
.Sy Safe
.Sh SEE ALSO
.Xr isainfo 1 ,
.Xr ld 1 ,
.Xr pargs 1 ,
.Xr attributes 5
.Rs
.%T Linker and Libraries Guide
.Re
.Rs
.%T SPARC Assembly Language Reference Manual
.Re
.Rs
.%T x86 Assembly Language Reference Manual
.Re
