gh-fork-dump/illumos-gate/usr/src/man/man2/processor_info.2
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\"
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\"
.Dd June 28, 2004
.Dt PROCESSOR_INFO 2
.Os
.Sh NAME
.Nm processor_info
.Nd determine type and status of a processor
.Sh SYNOPSIS
.In sys/types.h
.In sys/processor.h
.Ft int
.Fn processor_info "processorid_t processorid" "processor_info_t *infop"
.Sh DESCRIPTION
The
.Fn processor_info
function returns the status of the processor
specified by
.Fa processorid
in the
.Vt processor_info_t
structure pointed
to by
.Fa infop .
The structure contains the following members:
.Bd -literal -offset indent
int	pi_state;
char	pi_processor_type[PI_TYPELEN];
char	pi_fputypes[PI_FPUTYPE];
int	pi_clock;
.Ed
.Pp
The
.Va pi_state
member is the current state of the processor, either
.Dv P_ONLINE , P_OFFLINE , P_NOINTR , P_FAULTED , P_SPARE
or
.Dv P_POWEROFF .
.Pp
The
.Va pi_processor_type
member is a null-terminated ASCII string specifying the type of the processor.
.Pp
The
.Va pi_fputypes
member is a null-terminated ASCII string containing the comma-separated types
of floating-point units (FPUs) attached to the processor.
This string will be empty if no FPU is attached.
.Pp
The
.Va pi_clock
member is the processor clock frequency rounded to the nearest megahertz.
It may be 0 if not known.
.Sh RETURN VALUES
.Rv -std
.Sh ERRORS
The
.Fn processor_info
function will fail if:
.Bl -tag -width Er
.It Bq Er EINVAL
An non-existent processor ID was specified.
.Pp
The caller is in a non-global zone, the pools facility is active, and the
processor is not a member of the zone's pool's processor set.
.It Bq Er EFAULT
The
.Vt processor_info_t
structure pointed to by
.Fa infop
was not writable by the user.
.El
.Sh SEE ALSO
.Xr pooladm 1M ,
.Xr psradm 1M ,
.Xr psrinfo 1M ,
.Xr zoneadm 1M ,
.Xr p_online 2 ,
.Xr sysconf 3C
