gh-fork-dump/illumos-gate/usr/src/man/man2/pset_list.2
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\"
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\"
.Dd June 28, 2004
.Dt PSET_LIST 2
.Os
.Sh NAME
.Nm pset_list
.Nd get list of processor sets
.Sh SYNOPSIS
.In sys/pset.h
.Ft int
.Fn pset_list "psetid_t *psetlist" "uint_t *numpsets"
.Sh DESCRIPTION
The
.Fn pset_list
function returns a list of processor sets in the system.
.Pp
If
.Fa numpsets
is non-null, then on successful completion the number of processor sets
in the system will be stored in the location pointed to by
.Fa numpsets .
.Pp
If
.Fa numpsets
and
.Fa psetlist
are both non-null, then
.Fa psetlist
points to a buffer where a list of processor sets in the system
is to be stored, and
.Fa numpsets
points to the maximum number of processor set IDs the buffer can hold.
On successful completion, the list of processor sets up to the maximum buffer
size is stored in the buffer pointed to by
.Fa psetlist .
.Sh RETURN VALUES
.Rv -std
.Sh ERRORS
The
.Fn pset_list
function will fail if:
.Bl -tag -width Er
.It Bq Er EFAULT
The location pointed to by
.Fa psetlist
or
.Fa numpsets
was not null and not writable by the user.
.El
.Sh USAGE
If the caller is in a non-global zone and the pools facility is active,
.Fn pset_list
returns only the processor set of the pool to which the zone is bound.
.Sh INTERFACE STABILITY
.Sy Stable
.Sh MT-LEVEL
.Sy Async-Signal-Safe
.Sh SEE ALSO
.Xr pooladm 1M ,
.Xr psrset 1M ,
.Xr zoneadm 1M ,
.Xr processor_info 2 ,
.Xr pset_bind 2 ,
.Xr pset_create 2 ,
.Xr pset_info 2 ,
.Xr pset_getloadavg 3C ,
.Xr attributes 5
