gh-fork-dump/illumos-gate/usr/src/man/man2/pset_setattr.2
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\"
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\"
.Dd June 28, 2004
.Dt PSET_SETATTR 2
.Os
.Sh NAME
.Nm pset_setattr, pset_getattr
.Nd set or get processor set attributes
.Sh SYNOPSIS
.In sys/pset.h
.Ft int
.Fn pset_setattr "psetid_t pset" "uint_t attr"
.Ft int
.Fn pset_getattr "psetid_t pset" "uint_t *attr"
.Sh DESCRIPTION
The
.Fn pset_setattr
function sets attributes of the processor set specified by
.Fa pset .
The bitmask of attributes to be set or cleared is specified by
.Fa attr .
.Pp
The pset_getattr function returns attributes of the processor set specified by
.Fa pset .
On successful return,
.Fa attr
will contain the bitmask of attributes for the specified processor set.
.Pp
The value of the
.Fa attr
argument is the bitwise inclusive-OR of these
attributes, defined in
.In sys/pset.h :
.Bl -tag -width "PSET_NOESCAPE"
.It Dv PSET_NOESCAPE
Unbinding of LWPs from the processor set with this attribute requires the
.Brq Dv PRIV_SYS_RES_CONFIG
privilege to be asserted in the effective set of the calling process.
.El
.Pp
The binding of LWPs and processes to processor sets is controlled by
.Xr pset_bind 2 .
When the
.Dv PSET_NOESCAPE
attribute is cleared,
a process calling
.Fn pset_bind
can clear the processor set binding of any LWP whose real or effective user ID
matches its own real or effective user ID.
Setting the
.Dv PSET_NOESCAPE
attribute forces
.Fn pset_bind
to require the
.Brq Dv PRIV_SYS_RES_CONFIG
privilege to be asserted in the effective set of the calling process.
.Sh RETURN VALUES
.Rv -std pset_setattr pset_getattr
.Sh ERRORS
These functions will fail if:
.Bl -tag -width Er
.It Bq Er EFAULT
The location pointed to by
.Fa attr
was not writable by the user.
.It Bq Er EINVAL
An invalid processor set ID was specified.
.Pp
The caller is in a non-global zone, the pools facility is active, and the
processor is not a member of the zone's pool's processor set.
.It Bq Er ENOTSUP
The pools facility is active.
See
.Xr pooladm 1M
and
.Xr pool_set_status 3POOL
for information about enabling and disabling the pools facility.
.El
.Sh INTERFACE STABILITY
.Sy Stable
.Sh MT-LEVEL
.Sy Async-Signal-Safe
.Sh SEE ALSO
.Xr pooladm 1M ,
.Xr psrset 1M ,
.Xr zoneadm 1M ,
.Xr pset_bind 2 ,
.Xr pool_set_status 3POOL ,
.Xr attributes 5
