gh-fork-dump/illumos-gate/usr/src/man/man2/pset_info.2
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\"
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\"
.Dd June 28, 2004
.Dt PSET_INFO 2
.Os
.Sh NAME
.Nm pset_info
.Nd get information about a processor set
.Sh SYNOPSIS
.In sys/pset.h
.Ft int
.Fo pset_info
.Fa "psetid_t pset"
.Fa "int *type"
.Fa "uint_t *numcpus"
.Fa "processorid_t *cpulist"
.Fc
.Sh DESCRIPTION
The
.Fn pset_info
function returns information on the processor set
.Fa pset .
.Pp
If
.Fa type
is non-null, then on successful completion the type of the processor set will
be stored in the location pointed to by
.Fa type .
The only type supported for active processor sets is
.Dv PS_PRIVATE .
.Pp
If
.Fa numcpus
is non-null, then on successful completion the number of processors in the
processor set will be stored in the location pointed to by
.Fa numcpus .
.Pp
If
.Fa numcpus
and
.Fa cpulist
are both non-null, then
.Fa cpulist
points
to a buffer where a list of processors assigned to the processor set is to be
stored, and
.Fa numcpus
points to the maximum number of processor IDs the buffer can hold.
On successful completion, the list of processors up to the maximum buffer size
is stored in the buffer pointed to by
.Fa cpulist .
.Pp
If
.Fa pset is
.Dv PS_NONE ,
the list of processors not assigned to any processor set will be stored in the
buffer pointed to by
.Dv cpulist ,
and the number of such processors will be stored in the location pointed to by
.Fa numcpus .
The location pointed to by
.Fa type
will be set to
.Dv PS_NONE .
.Pp
If
.Fa pset is
.Dv PS_MYID ,
the processor list and number of processors returned will be those of the
processor set to which the caller is bound.
If the caller is not bound to a processor set, the result will be equivalent to
setting pset to
.Dv PS_NONE .
.Sh RETURN VALUES
.Rv -std
.Sh ERRORS
The
.Fn pset_info
function will fail if:
.Bl -tag -width Er
.It Bq Er EFAULT
The location pointed to by  type ,  numcpus , or  cpulist  was not
null and not writable by the user.
.It Bq Er EINVAL
An invalid processor set  ID  was specified.
.Pp
The caller is in a non-global zone, the pools facility is active, and the
processor is not a member of the zone's pool's processor set.
.El
.Sh INTERFACE STABILITY
.Sy Stable
.Sh MT-LEVEL
.Sy Async-Signal-Safe
.Sh SEE ALSO
.Xr pooladm 1M ,
.Xr psrinfo 1M ,
.Xr psrset 1M ,
.Xr zoneadm 1M ,
.Xr processor_info 2 ,
.Xr pset_assign 2 ,
.Xr pset_bind 2 ,
.Xr pset_create 2 ,
.Xr pset_destroy 2 ,
.Xr pset_getloadavg 3C ,
.Xr attributes 5
.Sh NOTES
The processor set of type
.Dv PS_SYSTEM
is no longer supported.
