gh-fork-dump/illumos-gate/usr/src/man/man2/uadmin.2
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\"
.\" Copyright 1989 AT&T
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\"
.Dd March 25, 2009
.Dt UADMIN 2
.Os
.Sh NAME
.Nm uadmin
.Nd administrative control
.Sh SYNOPSIS
.In sys/uadmin.h
.Ft int
.Fn uadmin "int cmd" "int fcn" "uintptr_t mdep"
.Sh DESCRIPTION
The
.Fn uadmin
function provides control for basic administrative functions.
This function is tightly coupled to the system administrative procedures and is
not intended for general use.
The argument
.Fa mdep
is provided for machine-dependent use and is not defined here.
It should be initialized to
.Dv NULL
if not used.
.Pp
As specified by
.Fa cmd ,
the following commands are available:
.Bl -tag -width "A_SHUTDOWN"
.It Dv A_SHUTDOWN
The system is shut down.
All user processes are killed, the buffer cache is flushed, and the root file
system is unmounted.
The action to be taken after the system has been shut down is specified by
.Fa fcn .
The functions are generic; the hardware capabilities vary on specific machines.
.Bl -tag -width "AD_FASTREBOOT"
.It Dv AD_HALT
Halt the processor(s).
.It Dv AD_POWEROFF
Halt the processor(s) and turn off the power.
.It Dv AD_BOOT
Reboot the system, using the kernel file.
.It Dv AD_IBOOT
Interactive reboot; user is prompted for bootable program name.
.It Dv AD_FASTREBOOT
Bypass BIOS and boot loader
.El
.It Dv A_REBOOT
The system stops immediately without any further processing.
The action to be taken next is specified by
.Fa fcn
as above.
.It Dv A_DUMP
The system is forced to panic immediately without any further processing and a
crash dump is written to the dump device
.Pq see Xr dumpadm 1M .
The action to be taken next is specified by
.Fa fcn ,
as above.
.It Dv A_REMOUNT
The root file system is mounted again after having been fixed.
This should beused only during the startup process.
.It Dv A_FREEZE
Suspend the whole system.
The system state is preserved in the state file.
The following subcommands, specified by
.Fa fcn ,
are available.
.Bl -tag -width Ds
.It Dv AD_SUSPEND_TO_DISK
Save the system state to the state file.
This subcommand is equivalent to ACPI state S4.
.It Dv AD_CHECK_SUSPEND_TO_DISK
Check if your system supports suspend to disk.
Without performing a system suspend/resume, this subcommand checks if this
feature is currently available on your system.
.It Dv AD_SUSPEND_TO_RAM
Save the system state to memory.
This subcommand is equivalent to ACPI state S3.
.It Dv AD_CHECK_SUSPEND_TO_RAM
Check if your system supports suspend to memory.
Without performing a system suspend/resume, this subcommand checks if this
feature is currently available on your system.
.El
.Pp
The following subcommands, specified by
.Fa fcn ,
are obsolete and might be removed in a subsequent release:
.Bl -tag -width Ds
.It Dv AD_COMPRESS
Save the system state to the state file with compression of data.
This subcommand has been replaced by
.Dv AD_SUSPEND_TO_DISK ,
which should be used instead.
.It Dv AD_CHECK
Check if your system supports suspend and resume.
Without performing a system suspend/resume, this command checks if this feature
is currently available on your system.
This subcommand has been replaced by
.Dv AD_CHECK_SUSPEND_TO_DISK ,
which should be used instead.
.It Dv AD_FORCE
Force
.Dv AD_COMPRESS
even when threads of user applications are not suspendable.
This subcommand should never be used, as it might result in undefined behavior.
.El
.El
.Sh RETURN VALUES
Upon successful completion, the value returned depends on
.Fa cmd
as follows:
.Bl -tag -width "A_SHUTDOWN"
.It Dv A_SHUTDOWN
Never returns.
.It Dv A_REBOOT
Never returns.
.It Dv A_FREEZE
0 upon resume.
.It Dv A_REMOUNT
0.
.El
.Pp
Otherwise the value -1 is returned and the global variable
.Va errno
is set to indicate the error.
.Sh ERRORS
The
.Fn uadmin
function will fail if:
.Bl -tag -width Er
.It Bq Er EBUSY
Suspend is already in progress.
.It Bq Er EINVAL
The
.Fa cmd
argument is invalid.
.It Bq Er ENOMEM
Suspend/resume ran out of physical memory.
.It Bq Er ENOSPC
Suspend/resume could not allocate enough space on the root file system to store
system information.
.It Bq Er ENOTSUP
Suspend/resume is not supported on this platform or the command specified by
.Fa cmd
is not allowed.
.It Bq Er ENXIO
Unable to successfully suspend system.
.It Bq Er EPERM
The
.Brq Dv PRIV_SYS_CONFIG
privilege is not asserted in the effective set of the calling process.
.El
.Sh INTERFACE STABILITY
The
.Dv A_FREEZE
command and its subcommands are
.Sy Committed .
.Sh SEE ALSO
.Xr dumpadm 1M ,
.Xr halt 1M ,
.Xr kernel 1M ,
.Xr reboot 1M ,
.Xr uadmin 1M ,
.Xr attributes 5 ,
.Xr privileges 5
.Sh WARNINGS
Shutting down or halting the system by means of
.Xr uadmin 1M
does not update the boot archive.
Avoid using this command after:
.Pp
.Bl -dash -compact
.It
Editing of files such as
.Pa /etc/system
.It
Installing new driver binaries or kernel binaries
.It
Updating existing driver binaries or kernel binaries.
.El
.Pp
Use
.Xr reboot 1M
or
.Xr halt 1M
instead.
